Tekla Open API Reference for Tekla Structures 2025
DotPrintToMultipleSheet Enumeration
 The print to multiple sheet type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintToMultipleSheet
Public Enumeration DotPrintToMultipleSheet
Members
Member name | Value | Description
Off | 0 |  Off.
LeftToRightAndTopToBottom | 1 |  Left to right and top to bottom.
BottomToTopAndRightToLeft | 2 |  Bottom to top and right to left.
See Also
Reference
Tekla.Structures.Drawing Namespace